// Задача 38: Задайте с клавиатуры массив ыещественных (double) чисел.
// Найдите разницу между максимальным и минимальным элементов массива.
// Задать размер (int) массива с клавиатуры
// [3 7 22 2 78] => 76

int[] array = new int[5];
Random rand = new Random();
double temp = Math.Round(rand.Next(0, 10) + rand.NextDouble(), 3);
System.Console.WriteLine(temp);

double min = 0;
double max = 0;

for (int i = 0; i < array.Length; i++)
{
    if (array[i] > max)
    {
        max = array[i];
    }
    if (array[i] < min)
    {
        min = array[i];
    }
}




Console.WriteLine($"всего {array.Length} чисел. Максимальное значение = {max}, минимальное значение = {min}");
Console.WriteLine($"Разница между максимальным и минимальным значением = {max - min}");
